{
  "common": {
    "name": "Nom",
    "tiny": "Petite",
    "errorVideo": "Votre navigateur ne supporte pas la vidéo.",
    "context": "Contexte",
    "objectives": "Objectifs",
    "icon": "Icône",
    "back": "Retour",
    "search": "Rechercher",
    "files": "Fichiers",
    "folder": "Dossier",
    "next": "Suivant",
    "projects": "Projets",
    "go": "Aller",
    "address": "Adresse",
    "design": "Maquette",
    "tasksDone": "Tâches réalisées sur le projet",
    "techInfo": "Informations techniques",
    "componentsDot": "Composants :",
    "components": "Composants",
    "models": "Modèles",
    "model": "Modèle",
    "links": "Liens",
    "link": "Lien",
    "hddDots": "HDD :",
    "disks": "Disques",
    "quantity": "Quantité",
    "viewModel": "Voir le modèle",
    "CDM": "MCD",
    "PDM": "MPD",
    "years": "ans",
    "webdev": "Développeur web",
    "textDocument": "Document texte",
    "loading": "Chargement...",
    "language": "Langue",
    "french": "Français",
    "english": "Anglais"
  },
  "message": {
    "welcome": "Bienvenue sur mon ordinateur.",
    "toBegin": "Pour commencer, cliquez sur mon nom d’utilisateur",
    "explainer": "Après avoir ouvert ma session, vous pourrez vous balader dans les dossiers de mon ordinateur. Depuis le bureau vous pourrez vois mes projets"
  },
  "header": {
    "disconnect": "Se Déconnecter",
    "shutdown": "Éteindre L'ordinateur"
  },
  "modale": {
    "fullscreenTitle": "Le mode plein écran est disponible !",
    "fullscreenFirstText": "Pour une expérience plus immersive,",
    "fullscreenSecondText": "Clickez sur l'icone d'écran ci-dessous",
    "control": "Contrôle"
  },
  "buttons": {
    "start": "démarrer",
    "downloadCV": "Télécharger le CV",
    "linkWebSite": "Voir le site",
    "linkRepository": "Voir le dépôt"
  },
  "windows": {
    "contact": {
      "name": "@:common.name",
      "description": "Envie de parler d'un projet, ou de simplement papoter, laissez moi un message, je reviendrai vers vous dans les plus brefs délais!",
      "email": "Email",
      "msgPlaceholder": "Entrez votre message ici...",
      "success": "Votre message a été envoyé avec succès",
      "error": {
        "email": " n'est pas une adresse e-mail valide",
        "empty": "Veuillez remplir tous les champs avant d'envoyer votre message",
        "unknown": "Le message n'a pas pu être envoyé. Vous pouvez me contacter directement à l'adresse email suivante: "
      },
      "send": "Envoyer",
      "cut": "Couper",
      "copy": "Copier",
      "paste": "Coller",
      "undo": "Annuler",
      "check": "Check",
      "spelling": "Orthographe",
      "attach": "Joindre",
      "priority": "Priorité",
      "sign": "Signer",
      "to": "A :",
      "from": "De :",
      "subject": "Objet :"
    },
    "cv": {
      "education": "Formation",
      "altPicture": "présentation CV",
      "proExperience": "Expérience professionnelle"
    },
    "music": {
      "title": "Titre",
      "album": "Album",
      "addedThe": "Ajouté le",
      "duration": "Durée",
      "link": "Liens",
      "artist": "Artiste",
      "description": "Une playlist créée spécialement pour mon portfolio, elle contient mes morceaux préférés.",
      "visitOnSpotify": "Voir sur Spotify",
      "albumCover": "Couverture de l'album",
      "playlistCoverAlt": "Couverture de la playlist"
    },
    "pictures": {
      "previous": "Photo précédente",
      "next": "Photo suivante",
      "rotateLeft": "Tourner à gauche",
      "rotateRight": "Tourner à droite"
    },
    "documents": {
      "about": {
        "title": "À propos",
        "contextFirstParagraph": "Ce projet est né de la volonté de créer un portfolio à la fois ludique et original.",
        "contextSecondParagraph": "L'idée était de créer l'interface de Windows XP sur ordinateur, qui permettrait aux visiteurs de naviguer dans les dossiers et les fichiers de la session de mon ordinateur.",
        "contextThirdParagraph": "Je voulais présenter mes projets sous un angle différent, où les utilisateurs pourraient se promener. Quelque chose de plus qu'une simple carte de visite sur le web. Quelque chose d'intéractif.",
        "contextFourthParagraph": "Le projet a été conçu pour être aussi proche que possible d'une véritable interface d'ordinateur Windows XP, avec un bureau, des dossiers et des fichiers.",
        "contextFifthParagraph": "Windows XP est le premier système d'exploitation que j'ai utilisé, et son design est pour moi une madeleine de proust. Je voulais lui rendre hommage.",
        "contextSixthParagraph": " Il m'a fallu environ un an pour le terminer (par intermittence).",
        "contextSeventhParagraph": "Ce projet a été fait avec beaucoup de passion et de patience, j'espère que vous apprécierez la visite !",
        "secondTitle": "Remerciements",
        "helpFirst": "Ce projet a été réalisé avec l'aide de Dockurr windows xp qui m'a permis de faire fonctionner un environnement Windows XP sur mon ordinateur très facilement.",
        "helpSecond": "L'API de Spotify m'a permis de récupérer les informations de ma playlist, de les afficher sur mon site et de mettre un player intégré.",
        "helpThird": "Pour la partie serveur, j'ai utilisé un serveur Node.js pour compiler ce site et pour gérer le formulaire de contact. Le site web est hébergé sur hostinger et le déploiement continu est fait avec mon serveur.",
        "helpFourth": "Le site web internet archive m'a permis de récupérer les images de Windows XP pour les intégrer dans mon projet. Merci à eux.",
        "helpFifth": "Mon chat a en partie aider en marchant sur mon clavier, mais elle a surtout été un soutien moral."
      },
      "legal": {
        "title": "Mentions légales",
        "firstParagraph": "Conformément aux dispositions de la loi n° 2004-575 du 21 juin 2004 pour la confiance en l'économie numérique, il est précisé aux utilisateurs du site Portfolio - Paul Jaguin l'identité des différents intervenants dans le cadre de sa réalisation et de son suivi.",
        "edit": "Edition du site",
        "secondParagraph": "Le présent site, accessible à l’URL https://pauljaguin.com (le « Site »), est édité par :",
        "thirdParagraph": "Paul Jaguin, résidant 29 Rue Jules Auffret, de nationalité Française (France), né(e) le 23/09/1999,",
        "hosting": "Hébergement",
        "fourthParagraph": "Le Site est hébergé par la société Hostinger International LTD, il est possible de les contacter à l'adresse suivante : https://www.hostinger.fr/contact",
        "dirPublication": "Directeur de publication",
        "fifthParagraph": "Le Directeur de publication est : Paul Jaguin.",
        "contact": "Contact",
        "sixthParagraph": "Pour toute question, information sur les produits présentés sur le Site, ou concernant le Site lui-même, vous pouvez laisser un message à l'adresse email suivante :"
      }
    }
  },
  "project": {
    "logma": {
      "contextFirstParagraph": "Logma production est une société de production audiovisuelle basée à Rennes. Fondée par Baptiste Fablet. Au début de ce projet, il existait déjà un site logma production fait par le gérant avec un site sous Wordpress.",
      "contextSecondParagraph": "La décision a été prise de refaire ce site de 0, avec une stack technique simple et éprouvée, tenter de faire un site web sans Framework et sans assistance quelquonce afin de le rendre rapide et efficace.",
      "contextThirdParagraph": "Dans le but de rendre le gérant autonome sur la gestion de ce site il a fallu développer un backoffice depuis lequel il pourrait publier de nouvelles photos, ajouter des projets et les liens vers ses vidéos",
      "goalFirst": "Refonte du site web avec l'identité graphique déjà en place",
      "goalSecond": "Créer un site web responsive",
      "goalThird": "Développer un backoffice pour la gestion du site",
      "goalFourth": "Optimiser le SEO",
      "goalFifth": "Améliorer la vitesse de chargement et les performances au global",
      "goalSixth": "Le mettre en production"
    },
    "pangaia": {
      "contextFirstParagraph": "Pangaia est une application open source, qui cherche à sensibilser autour des plantes.",
      "contextSecondParagraph": "Le but étant de créer une interface ludique et pratique pour avoir une gestion de son jardin.",
      "contextThirdParagraph": "Mais également pouvoir découvrir de nouvelles plantes en utilisant la gamification.",
      "contextFourthParagraph": "Donner des informations sur la flore qui nous entoure en fonction de la localication de l'utilisateur.",
      "goalFirst": "Pouvoir essayer l'application en mode démo",
      "goalSecond": "Accéder à la fiche d'une plante",
      "goalThird": "Pouvoir modéliser son jardin",
      "goalFourth": "Pouvoir ajouter une plante à son jardin",
      "goalFifth": "Avoir une connexion à la météo en temps réel",
      "goalSixth": "Avoir des rappels de tâches à réaliser sur sa plante ou dans son jardin",
      "tasksDoneFirst": "Aide à la conception et à la modélisation de la base de données",
      "tasksDoneSecond": "Maquettage de l'application",
      "tasksDoneThird": "Travail sur l'UX avec des tests d'ergonomie",
      "tasksDoneFourth": "Création d'un dashboard",
      "tasksDoneFifth": "Réalisation de la page listant les plantes et les catégories",
      "tasksDoneSixth": "Mise en place d'une API et de la documentation avec Swagger",
      "CDMText": "Modélisation conceptuelle partielle de la base de donnée, concernant les modifications à apporter au projet.",
      "PDMText": "Modélisation de la base de donnée relationnelle complète."
    },
    "clench": {
      "contextFirstParagraph": "Un exercice dans le cadre d'un cours de Framework CSS & Maquettage à MyDigitalSchool Rennes.",
      "contextSecondParagraph": "Le but, faire l'interface graphique d'une application web en une semaine. Pas de backend donc, mais toute la conception graphique.",
      "contextThirdParagraph": "Un site web sur le thème du campus, faire un support fictif sur lequel le BDE puisse communiquer.",
      "contextFourthParagraph": "Avec l'aide de Baptiste Marie, étudiant également, nous avons donc créée l'identité graphique et développer ce site web.",
      "goalFirst": "Maquetter un site web et un wireframe en se basant sur un cahier des charges client",
      "goalSecond": "Développer une identité graphique simple",
      "goalThird": "Développer le front de l'application en utilisant un Framework CSS",
      "goalFourth": "Mettre le site en production",
      "goalFifth": "Travailler en équipe",
      "goalSixth": "Tenir le délai d'une semaine"
    },
    "emc2": {
      "contextFirstParagraph": "Dans le cadre de mon alternance chez Screenup, j’ai réalisé la page agenda et le gabarit des pages événements pour la salle EMC2 à St Grégoire.",
      "contextSecondParagraph": "J'ai utilisé le plugin ACF de WordPress pour ajouter des champs personnalisés, permettant à l'équipe de la salle de spéctacle de créer du contenu et ajouter des évènements facilement.",
      "contextThirdParagraph": "Le projet s’est basé sur une maquette du webdesigner de Screenup, en accord avec l’identité visuelle et les besoins du client.",
      "contextFourthParagraph": "Les mises en production ont été testées en staging et déployées via SSH avec Visual Studio Code.",
      "goalFirst": "Créer une interface intuitive pour consulter les événements.",
      "goalSecond": "Permettre une gestion facile des événements via le back-office.",
      "goalThird": "Appliquer un design en accord avec l’identité EMC2.",
      "goalFourth": "Tester en staging pour garantir la stabilité du site.",
      "goalFifth": "Déployer les mises à jour en production via SSH.",
      "goalSixth": "Optimiser la navigation pour une meilleure expérience utilisateur."
    },
    "homeserver": {
      "contextFirstParagraph": "Ce projet a été réalisé en binôme, Pierre qui a une société de production vidéo, et moi développeur web.",
      "contextSecondParagraph": "Une équipe sur laquelle on ne miserait pas forcément pour monter un serveur, j'en conviens. Mais une passion commune nous anime. Creuser des sujets qu'on ne connaît pas et essayer de comprendre comment un serveur fonctionne et comment le mettre en place.",
      "goalFirst": "Faire un serveur de stockage qui permette également de déployer des applications",
      "goalSecond": "Pouvoir y accéder à distance",
      "goalThird": "Permettre de monter une vidéo sur des fichiers distants",
      "goalFourth": "Pouvoir installer des services d'automatisation comme Jenkins, Sonarqube, etc...",
      "goalFifth": "Avoir un monitoring des sites web en ligne, et des alertes en cas de perte de services",
      "goalSixth": "Hebérger des sites de préproduction avant de les mettre en ligne",
      "goalSeventh": "De la redondance dans les données et dans la manière d'y accéder à distance",
      "goalEighth": "Pouvoir maintenir ce système facilement",
      "goalNinth": "Être moins cher qu'un équivalent prémonté avec les mêmes performances",
      "specs": {
        "motherboard": "🧠 Motherboard + processor",
        "ram": "⚡ RAM",
        "case": "🗄️ Boitier",
        "powerSupply": "🔌 Alimentation",
        "ssdBoot": "💾 SSD boot",
        "ssdNas": "💽 SSD Nas",
        "splitter": "➿ Répartiteur SATA",
        "hddSpecs": "🗃️ HDD Western Digital"
      }
    }
  },
  "alt": {
    "logoStart": "Logo portfolio XP noir démarrage",
    "logoLoading": "Logo portfolio XP noir chargement",
    "logoLogin": "Logo portfolio XP blanc connexion",
    "currLang": "Langue actuelle"
  }
}
